In [2]:
import numpy as np
import pandas as pd

In [4]:
books = pd.read_csv('books.csv')
ratings = pd.read_csv('Ratings.csv')
users = pd.read_csv('Users.csv')

C:\Users\ShivSwayambhu\AppData\Local\Temp\ipykernel_984\287993531.py:1: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  books = pd.read_csv('books.csv')

In [6]:
books.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

In [7]:
users.head()

   User-ID                            Location   Age
0        1                  nyc, new york, usa   NaN
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia   NaN
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom   NaN

In [8]:
ratings.head()

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

In [9]:
print(books.shape)
print(ratings.shape)
print(users.shape)

(271360, 8)
(1149780, 3)
(278858, 3)

In [10]:
# Check for missing values in the datasets and making the sum of missing values
print("Missing values in books dataset:")
books.isnull().sum()

Missing values in books dataset:

ISBN                   0
Book-Title             0
Book-Author            2
Year-Of-Publication    0
Publisher              2
Image-URL-S            0
Image-URL-M            0
Image-URL-L            3
dtype: int64

In [11]:
#cheking for missing values in ratings dataset
print("Missing values in ratings dataset:")
ratings.isnull().sum()

Missing values in ratings dataset:

User-ID        0
ISBN           0
Book-Rating    0
dtype: int64

In [13]:
#cheking the missing values in users dataset using isnull() and sum()
print("Missing values in users dataset:")
users.isnull().sum()

Missing values in users dataset:

User-ID          0
Location         0
Age         110762
dtype: int64

In [16]:
users.head()

   User-ID                            Location   Age
0        1                  nyc, new york, usa   NaN
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia   NaN
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom   NaN

In [ ]:
#checking the duplicate values in the books dataset using duplicated() and sum()
print("Duplicate values in books dataset:")
books.duplicated().sum()

Duplicate values in books dataset:

0

In [19]:
#checking the duplicate values in the users dataset using duplicated() and sum()
print("Duplicate values in users dataset:")
users.duplicated().sum()

Duplicate values in users dataset:

0

In [21]:
#cheking the duplicated values in the ratings dataset using duplicated() and sum()
print("Duplicate values in ratings dataset:")
ratings.duplicated().sum()

Duplicate values in ratings dataset:

0

# Popularity Based Recommendation System

In [ ]:
rating_with_name = ratings.merge(books, on='ISBN')

TypeError: Can only merge Series or DataFrame objects, a <class 'str'> was passed